/***********************************************************************************************
 * 文件:    color.h
 *
 * 说明:    颜色方案
 *
 * 作者:    Jun
***********************************************************************************************/
#ifndef  FAMES_GUI_COLOR_H
#define  FAMES_GUI_COLOR_H

/*----------------------------------------------------------------------------------------------
 * 
 * RESERVED COLORS for USER APPLICATION
 * 
**--------------------------------------------------------------------------------------------*/
/* 颜色值0~64保留给用户使用 */

/*----------------------------------------------------------------------------------------------
 * 
 * COLOR for clear screen
 * 
**--------------------------------------------------------------------------------------------*/
#define CLRSCR_COLOR    65

#define CLRSCR_COLOR1   64  /* 深棕色               */
#define CLRSCR_COLOR2   65  /* 海蓝色(XP桌面的颜色) */

#define COLOR_BLACK     70  /* 黑色                 */
#define COLOR_WHITE     71  /* 白色                 */

/*----------------------------------------------------------------------------------------------
 * 
 * 其它颜色
 * 
**--------------------------------------------------------------------------------------------*/
#define COLOR_BROWN     64

#define COLOR_GRAY      0xF8
#define COLOR_RED       0xF9
#define COLOR_GREEN     0xFA
#define COLOR_YELLOW    0xFB
#define COLOR_BLUE      0xFC
#define COLOR_PINK      0xFD
#define COLOR_CYAN      0xFE

/*----------------------------------------------------------------------------------------------
 * 
 * 重要颜色说明: 75(3A,39,35)是分析windows窗口得出的最接近的调色值
 * 
**--------------------------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------------------------
 * 
 * 所有控件通用颜色定义
 *
 * ?1? 代表左边与上边, ?2?代表右边与下边
 *
 * ??1 代表最外层, ??2代表次外层
 * 
**--------------------------------------------------------------------------------------------*/
#define WIDGET_BKCOLOR                75
#define WIDGET_EDIT_BKCOLOR           76
#define WIDGET_COLOR_TITLE_XP         72
#define WIDGET_COLOR_TITLE_NORMAL     73
#define WIDGET_COLOR_STATIC_BDR       74
#define WIDGET_COLOR_BDR_XP_11        80
#define WIDGET_COLOR_BDR_XP_12        81
#define WIDGET_COLOR_BDR_XP_13        82
#define WIDGET_COLOR_BDR_XP_21        84
#define WIDGET_COLOR_BDR_XP_22        85
#define WIDGET_COLOR_BDR_XP_23        86
#define WIDGET_COLOR_NORMAL_BDR1      88
#define WIDGET_COLOR_NORMAL_BDR2      89
#define WIDGET_COLOR_NORMAL_BDR3      90
#define WIDGET_COLOR_NORMAL_BDR4      91
#define WIDGET_COLOR_NORMAL_BDR5      92
#define WIDGET_COLOR_NORMAL_BDR6      93

/*----------------------------------------------------------------------------------------------
 * 
 * 进度条控件默认前景色
 *
**--------------------------------------------------------------------------------------------*/
#define WIDGET_PROGRESS_COLOR        144

/*----------------------------------------------------------------------------------------------
 * 
 * 会闪烁的颜色
 *
**--------------------------------------------------------------------------------------------*/
#define COLOR_BLINK                  201
#define COLOR_WARNING                202
#define COLOR_WARNING_236            203

#endif /* #ifndef FAMES_GUI_COLOR_H */

/*==============================================================================================
 * 
 * 本文件结束: color.h
 * 
**============================================================================================*/



