/******************************************************************************************
 * 文件:    gui/widget/desktop.h
 *
 * 描述:    桌面控件
 *
 * 作者:    Jun
 *
 * 时间:    2012-12-21
******************************************************************************************/
#ifndef FAMES_GUI_DESKTOP_H
#define FAMES_GUI_DESKTOP_H


/*-----------------------------------------------------------------------------------------
 * 
 *      DESKTOP风格
 * 
**---------------------------------------------------------------------------------------*/
#define DESKTOP_STYLE_TRANSPARENT      0x0001       /* 透明          */


/*-----------------------------------------------------------------------------------------
 * 
 *      函数声明
 * 
**---------------------------------------------------------------------------------------*/
int guical gui_desktop_enable(void);
int guical gui_desktop_disable(void);
int guical gui_desktop_set_color(COLOR color);

void __internal gui_desktop_init(void);
void __internal gui_draw_desktop(gui_widget * c);
INT16U          gui_desktop_get_property(gui_widget * desktop);




#endif /* #ifndef FAMES_GUI_DESKTOP_H */

/*=========================================================================================
 * 
 * 本文件结束: gui/widget/desktop.h
 * 
**=======================================================================================*/


