/******************************************************************************************
 * 文件: gui/widget/pool.h
 *
 * 描述: 控件池(控件的分配与回收)
 *
 * 作者: Jun
******************************************************************************************/
#ifndef FAMES_GUI_WIDGET_POOL_H
#define FAMES_GUI_WIDGET_POOL_H

/*-----------------------------------------------------------------------------------------
 * 
 *      函数声明
 * 
**---------------------------------------------------------------------------------------*/
BOOL guical __init gui_widget_pool_init(void);
void guical __exit gui_widget_pool_free(void);

gui_widget  * guical gui_alloc_widget(void);
void          guical gui_free_widget(gui_widget * gc);


#endif /* #ifndef FAMES_GUI_WIDGET_POOL_H */

/*=========================================================================================
 * 
 * 本文件结束: gui/widget/pool.h
 * 
**=======================================================================================*/


