/*************************************************************************************
** 文件: onexit.h
**
** 说明: 退出例程处理
**
** 作者: Jun
**
** 时间: 2010-7-5
*************************************************************************************/
#ifndef FAMES_ON_EXIT_H
#define FAMES_ON_EXIT_H

/*------------------------------------------------------------------------------------
 *      OnExit模块支持, 1=支持, 0=不支持
**----------------------------------------------------------------------------------*/
#define FAMES_ON_EXIT_EN 1           

/*------------------------------------------------------------------------------------
 *      OnExit例程的最大个数
**----------------------------------------------------------------------------------*/
#define ON_EXIT_NUM     32

typedef void (*onexit_func)(void); /* OnExit例程类型 */

/*------------------------------------------------------------------------------------
 *      函数声明
**----------------------------------------------------------------------------------*/
#if FAMES_ON_EXIT_EN == 1

void apical InitializeOnExit(void);
BOOL apical RegisterOnExit(onexit_func);
BOOL apical DeregisterOnExit(onexit_func);
void apical ProcessOnExit(void);

#else

#define InitializeOnExit()
#define RegisterOnExit(x)
#define DeregisterOnExit(x)
#define ProcessOnExit()

#endif  /* #if FAMES_ON_EXIT_EN == 1 */

#endif  /* #ifndef FAMES_ON_EXIT_H   */
/*====================================================================================
 * 
 * 本文件结束: onexit.h
 * 
**==================================================================================*/


