/***********************************************************************************************
 * 文件:    siemens.h
 *
 * 描述:    西门子PLC相关定义
 *
 * 作者:    Jun
***********************************************************************************************/
#ifndef FAMES_PLC_SIEMENS_H
#define FAMES_PLC_SIEMENS_H

/*----------------------------------------------------------------------------------------------
 * 
 *      西门子PLC编译开关
 * 
**--------------------------------------------------------------------------------------------*/
#define FAMES_PLC_SIEMENS_EN   1 

/*----------------------------------------------------------------------------------------------
 * 
 * PROTOCOL TYPE OF SIEMENS PLC
 * 
**--------------------------------------------------------------------------------------------*/
#define SIEMENS_PROT_TYPE_PPI  1              /* PPI, Not Used!                     */
#define SIEMENS_PROT_TYPE_RTU  2              /* RTU                                */

#define SIEMENS_PROT_TYPE  SIEMENS_PROT_TYPE_RTU  /* RTU is used here               */

/*----------------------------------------------------------------------------------------------
 * 
 * 西门子PLC操作命令(RTU协议)
 * 
**--------------------------------------------------------------------------------------------*/
#define SIEMENS_PLC_READ_VW    1              /* 西门子PLC读命令, VW                */
#define SIEMENS_PLC_READ_VD    2              /* 西门子PLC读命令, VD                */
#define SIEMENS_PLC_WRITE_VW   3              /* 西门子PLC写命令, VW                */
#define SIEMENS_PLC_WRITE_VD   4              /* 西门子PLC写命令, VD                */
#define SIEMENS_PLC_RUN        5              /* 西门子PLC之RUN命令                 */
#define SIEMENS_PLC_STOP       6              /* 西门子PLC之STOP命令                */

/*----------------------------------------------------------------------------------------------
 * 
 * 通讯协议相关定义(暂时没有)
 * 
**--------------------------------------------------------------------------------------------*/




/*----------------------------------------------------------------------------------------------
 * 
 * 函数声明
 * 
**--------------------------------------------------------------------------------------------*/
#if  FAMES_PLC_SVC_EN == 1 && FAMES_PLC_SIEMENS_EN == 1
void __sysonly plc_common_isr_siemens(PLC * plc);
BOOL __sysonly plc_control_siemens(PLC * plc, PLC_ACTION * action);
#else
#define  plc_common_isr_siemens(plc)
#define  plc_control_siemens(plc, action) fail
#endif

#endif /* #ifndef FAMES_PLC_SIEMENS_H */

/*==============================================================================================
 * 
 * 本文件结束: siemens.h
 * 
**============================================================================================*/

