/*************************************************************************************
 * 文件: console.h
 *
 * 说明: 控制台
 *
 * 作者: Jun
*************************************************************************************/
#ifndef FAMES_CONSOLE_H
#define FAMES_CONSOLE_H

/*------------------------------------------------------------------------------------
 *
 *      函数声明
 *
**----------------------------------------------------------------------------------*/
void apical __init InitConsoleSvc(void);
BOOL apical OpenConsole(void);
BOOL apical CloseConsole(void);
void    clrkey(void);               /* 清空键缓冲       */
KEYCODE getkey(void);               /* 读取一个按键     */
BOOL    putkey(KEYCODE);            /* 增加一个按键     */
KEYCODE waitkey(INT32U timeout);    /* 等待一个按键     */

/*------------------------------------------------------------------------------------
 *
 *      内部函数声明(应用程序不应直接调用)
 *
**----------------------------------------------------------------------------------*/
void __sysonly apical SendConsoleKey(KEYCODE key);


#endif /* #ifndef FAMES_CONSOLE_H */
/*====================================================================================
 * 
 * 本文件结束: console.h
 * 
**==================================================================================*/

