/***********************************************************************************************
** 文件: tftpd.h
** 说明: tftp服务器(Trivial File Transfer Protocol)
** 作者: Jun
***********************************************************************************************/
#ifndef FAMES_TFTPD_H
#define FAMES_TFTPD_H

/*----------------------------------------------------------------------------------------------
 *
 * TFTP启用开关, 1=启用
 *
**--------------------------------------------------------------------------------------------*/
#define TFTP_ENABLE    1

#if     TFTP_ENABLE == 1
/*----------------------------------------------------------------------------------------------
 *
 * TFTP报文首部结构及常数
 *
**--------------------------------------------------------------------------------------------*/
struct tftphdr {
    INT16U  opcode;
    union {
        INT16U id;
        struct {
            INT16U err;
            INT08S err_msg[2];
        }err;
        INT08S filename[2];
    } un;
};

#define  TFTP_OP_RRQ  1
#define  TFTP_OP_WRQ  2
#define  TFTP_OP_DAT  3
#define  TFTP_OP_ACK  4
#define  TFTP_OP_ERR  5

#define  TFTP_OP_XXX  6 /* 自己定义, 无意义 */

/*----------------------------------------------------------------------------------------------
 *
 * 函数声明
 *
**--------------------------------------------------------------------------------------------*/
void apical tftpd_dispatcher(INT08S * ip_pkt, INT16S pkt_len);
BOOL apical tftpd_xmit(INT32U target_ip, INT16U target_port, INT16U opcode, 
                       INT16U blkid, INT08S *buf, INT16U buf_len);
INT08S * apical get_tftpd_message(INT08S * dst_message_buf);

#endif                          /* TFTP_ENABLE == 1       */
#endif                          /* #ifndef FAMES_TFTPD_H  */

/*==============================================================================================
 * 
 * 本文件结束: tftpd.h
 * 
**============================================================================================*/

