/***********************************************************************************************
 * 文件:    plc_svc.c
 *
 * 说明:    PLC服务器
 *
 * 作者:    Jun
 *
 * 时间:    2010-12-15
***********************************************************************************************/
#define  FAMES_PLC_SVC_C
#include <includes.h>

#if FAMES_PLC_SVC_EN == 1

/*------------------------------------------------------------------------------------
 * 函数:    InitPLCService()
 * 
 * 说明:    PLC服务器初始化
**----------------------------------------------------------------------------------*/
void __init apical InitPLCService(void)
{
    void __internal __exit OnExitPLCService(void);
    void __internal __init __init_plc_common(void);

    __init_plc_common(); /* 初始化PLC控制块缓冲区 */

    if(!RegisterOnExit(OnExitPLCService)){
        /*
        * do something here...
        */
    }
}

/*------------------------------------------------------------------------------------
 * 函数:    OnExitPLCService()
 * 
 * 说明:    PLC服务器退出例程
**----------------------------------------------------------------------------------*/
void __internal __exit OnExitPLCService(void)
{
    void __internal __exit __exit_plc_common(void);

    __exit_plc_common();
}

#endif /* FAMES_PLC_SVC_EN == 1 */

/*==============================================================================================
 * 
 * 本文件结束: plc_svc.c
 * 
**============================================================================================*/

